toroidal_rov_thruster/prototype1D_1B14_openFOAM/prototype1D_1B14_v2412/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          controlDict;
}

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          1;

writeControl    timeStep;

writeInterval   250;

purgeWrite      2;

writeFormat     binary;

writePrecision  8;

runTimeModifiable true;

functions
{
    rotorForces
    {
        type            forces;
        libs            ( forces );
        patches         ( rotor );
        rho             rhoInf;
        rhoInf          1025;
        CofR            ( 0 0 0 );
        writeControl    timeStep;
        writeInterval   10;
    }
    ductForces
    {
        type            forces;
        libs            ( forces );
        patches         ( duct );
        rho             rhoInf;
        rhoInf          1025;
        CofR            ( 0 0 0 );
        writeControl    timeStep;
        writeInterval   10;
    }
    residuals
    {
        type            solverInfo;
        libs            ( utilityFunctionObjects );
        fields          ( U p k omega );
        writeControl    timeStep;
        writeInterval   1;
    }
    yPlus
    {
        type            yPlus;
        libs            ( fieldFunctionObjects );
        writeControl    writeTime;
    }
    pressureRange
    {
        type            fieldMinMax;
        libs            ( fieldFunctionObjects );
        fields          ( p );
        writeControl    timeStep;
        writeInterval   10;
    }
}


// ************************************************************************* //
