toroidal_rov_thruster/prototype1D_1B14_openFOAM/prototype1D_1B14_v2412/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

// How many CPU cores the solver uses. This PC has 20; 8 leaves room for other work.
numberOfSubdomains 8;

method          scotch;
