toroidal_rov_thruster/prototype1D_1B14_openFOAM/prototype1D_1B14_v2412/system/surfaceFeatureExtractDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}

// Sharp edges (blade trailing edges, duct lips) that snappyHexMesh should keep.

rotor_1B14.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
    writeObj            yes;
}

duct_1B14.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
    writeObj            yes;
}
