toroidal_rov_thruster/prototype1D_1B14_openFOAM/prototype1D_1B14_v2412/system/topoSetDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// The cells that spin with the rotor (the MRF zone).
// Radius 57 mm covers the measured rotor tip (55.5 mm); x = -22..22 mm covers
// the rotor (-15..18 mm). The duct is listed in constant/MRFProperties
// nonRotatingPatches, so it stays still even where it lies inside this zone.

actions
(
    {
        name    mrfZone;
        type    cellZoneSet;
        action  new;
        source  cylinderToCell;
        p1      (-0.022 0 0);
        p2      ( 0.022 0 0);
        radius  0.057;
    }
);
